tap "alexstrnik/browserino", "https://github.com/AlexStrNik/homebrew-Browserino"
tap "anomalyco/tap"
tap "marsanne/cask"
# Java build tool
brew "ant"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Simple terminal UI for git commands
brew "lazygit"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Deep clean and optimize your Mac
brew "mole"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Display and control your Android device
brew "scrcpy"
# Terminal multiplexer
brew "tmux"
# Tool for managing your YubiKey configuration
brew "ykman"
# Flexible and fast Zsh plugin manager
brew "zinit"
# CPU management application
cask "app-tamer"
# App for managing battery charging
cask "batfi"
# Desktop password and login vault
cask "bitwarden"
# Scriptable scratchpad for developers
cask "boop"
# Browserino is a tiny browser selector for MacOS written in SwiftUI
cask "alexstrnik/browserino/browserino"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# The Ultimate Homebrew Companion
cask "marsanne/cask/cork"
# Downloads videos from different websites
cask "downie"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Document editor
cask "onlyoffice"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Colour picker for colours onscreen
cask "pika"
# Intercept and modify HTTP requests
cask "requestly"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Open-source code editor
cask "visual-studio-code"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
