tap "alexstrnik/browserino"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "marsanne/cask"
brew "ant"
brew "apktool"
brew "git"
brew "asdf"
brew "bundletool"
brew "coreutils"
brew "curl"
brew "gawk"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "graphviz"
brew "grep"
brew "groovysdk"
brew "libxml2"
brew "lsd"
brew "maven"
brew "mint"
brew "pidcat"
brew "pinentry-mac"
brew "scrcpy"
brew "svgo"
brew "ykman"
brew "zinit"
cask "android-commandlinetools"
cask "app-tamer"
cask "audacity"
cask "boop"
cask "browserino"
cask "bruno"
cask "cork"
cask "docker-desktop"
cask "downie"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "hiddenbar"
cask "iina"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keepassxc"
cask "keka"
cask "keystore-explorer"
cask "lm-studio"
cask "localsend"
cask "mac-mouse-fix"
cask "minisim"
cask "monarch"
cask "monitorcontrol"
cask "msty"
cask "openinterminal"
cask "pika"
cask "sloth"
cask "stats"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alexdima.copy-relative-path"
vscode "blono.git-last-commit-message-fork"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "diemasmichiels.emulate"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "jamesmaj.easy-icons"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "saoudrizwan.claude-dev"
vscode "swiftlang.swift-vscode"
vscode "taiyuuki.vscode-cargo-scripts"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
