# Formatted from output of `brew bundle dump`
# `brew bundle dump --file=Brewfile-$(date +%Y.%m.%d-%H.%M.%S) --force`

tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "marsanne/cask"
brew "ant"
brew "apktool"
brew "coreutils"
brew "asdf"
brew "bundletool"
brew "curl"
brew "gawk"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "groovysdk"
brew "lsd"
brew "maven"
brew "pidcat"
brew "pinentry-mac"
brew "scrcpy"
brew "swiftlint"
brew "zinit"
cask "android-commandlinetools"
cask "android-studio"
cask "app-tamer"
cask "bitwarden"
cask "boop"
cask "bruno"
cask "cork"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "keystore-explorer"
cask "mac-mouse-fix"
cask "minisim"
cask "monitorcontrol"
cask "pika"
cask "sloth"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alexdima.copy-relative-path"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "diemasmichiels.emulate"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "jamesmaj.easy-icons"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "rvest.vs-code-prettier-eslint"
vscode "tal7aouy.rainbow-bracket"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"

